{
  "start": 1577896200000,
  "duration": 25,
  "room": "K.4.601",
  "title": "Improving the Security of Edge Computing Services",
  "subtitle": "Update status of the support for AMD processors",
  "track": "Open Source Firmware, BMC and Bootloader",
  "abstract": "<p>For the last several years, hypervisors have played a key role in platform\nsecurity by reducing the possible attack surface. At the same time, the hype\nsurrounding computing and Internet of Things Gateways has led to an increase in\nnetwork appliance devices. Our target was to create a less-insecure virtual\nnetwork appliance using TrenchBoot, Trusted Platform Module 2.0 and AMD SKINIT\nDynamic Root of Trust for Measurement to establish a Xen hypervisor with a\nmeta-virtualized pfSense firewall. We are going to present it with an update\nof the status of support of TrenchBoot for AMD processors.\nThis appliance is supported by are supported by apu2, a reliable low-SWaP x86\ndevice from Swiss OEM PC Engines. It can be used as a Single Office / Home\nOffice firewall or an industrial edge device and has mostly open-source\nhardware, coreboot firmware, mPCIe extensibility and an extended support\nlifecycle for the embedded Central Processing Unit and motherboard.\nIn this talk, we will show how to create a system, which enables a significant\nportion of computations to the edge devices while maintaining security. Using\na simple, well-known platform, we will conduct a secure boot using the Static\nRoot of Trust for Measurement with coreboot, move to the Dynamic Root of Trust\nfor Measurement by SKINIT in TrenchBoot and use all of this to provide a\ncomplete chain of trust for the Xen hypervisor, a virtual firewall appliance\nisolated by an input–output memory management unit (IOMMU) from the physical\nnetwork interface controller (NIC) devices. We will present benchmark data\non virtualization overhead, explain how this complexity can still be practical\nand outline the value of this stack.</p>",
  "description": "",
  "persons": [
    "Daniel Kiper",
    "Piotr Król"
  ]
}