{
  "start": 1577881800000,
  "duration": 25,
  "room": "UD2.218A",
  "title": "Introduction to Eclipse iceoryx",
  "subtitle": "Writing a safe IPC framework for autonomous robots and cars",
  "track": "Embedded, Mobile and Automotive",
  "abstract": "<p>Bosch has open sourced a true zero-copy middleware for inter-process communication\non modern robotics and vehicle computers. The shared memory based\nsolution is compatible with Linux/QNX and achieves data independent communication\nin constant time without serializing data. We would like to present our\nrecent development towards an open-source release and demonstrate our performance\nand timing benchmarks on a privately developed embedded robot.</p>",
  "description": "<p>On FOSDEM 2018 Bosch presented OpenADx, an initiative to collaborate and accelerate\nthe development of automated driving with the open source community.\nOn FOSDEM 2020 we would like to present the first project under the OpenADx\numbrella called Eclipse iceoryx TM.\nOver the course of its company history, Bosch could establish a solid understanding\nof the needs and requirements of the automotive domain in terms of liability,\nreliability, safety and determinism. In a time where highly automated driving hits\nthe road, these aspects become more and more important. An automated driving\nkit is a networked system that processes a sensor data stream in the range\nof GBytes/s. This naturally arises the need of an efficient and lightweight data\ntransfer mechanism. Our group at Bosch has its main focus on tackling exactly\nthis challenge. In order to approach the problem of distributing the high frequency,\nhigh throughput data streams on fusion and planning computers, we’ve developed\na solution which can guarantee a time constant communication channel independently\nof the size of data to be transported. Our approach is based on shared\nmemory which allows for transparently connecting the same range of memory\nbetween multiple processes and thus enables a true zero-copy communication.\nGiven the nature of shared memory, an efficient data transport can thus be realized\nsolely by passing pointers to memory addresses from publishers to subscribers.\niceoryx is fully compatible with the ROS2 and Adaptive AUTOSAR APIs\nand can be used as an implementation for both.</p>",
  "persons": [
    "Simon Hoinkis"
  ]
}