{
  "start": 1577886000000,
  "duration": 15,
  "room": "H.2215 (Ferrer)",
  "title": "PICTOR: A free-to-use open source radio telescope",
  "subtitle": "",
  "track": "Lightning Talks",
  "abstract": "<p>PICTOR, located in Athens, Greece, consists of a 1.5-meter parabolic antenna that allows anyone to make continuous and spectral (i.e. hydrogen line) drift-scan observations of the radio sky in the 1300~1700 MHz regime for free. The goal of this effort is to introduce students, educators, astronomers and others to the majesty of the radio sky, promoting radio astronomy education, without the need of building a large and expensive radio telescope.</p>\n\n<p>PICTOR is a fully open source (software &amp; hardware) project: https://github.com/0xCoto/PICTOR</p>",
  "description": "<p>PICTOR is a free-to-use open source and open hardware radio telescope that aims to promote radio astronomy on a budget. It consists of a 1.5 meter parabolic dish antenna, a 1420 MHz-optimized feedhorn, a two stage low noise amplifier (LNA) with a built-in high-pass filter, and an RTL-SDR. Future upgrades may also use higher-bandwidth SDRs, such as the LimeSDR Mini.</p>\n\n<p>This radio telescope allows users to measure hydrogen line emissions from our galaxy. Under certain conditions, hydrogen atoms can emit photons with a wavelength of 21 cm, which corresponds to a frequency of 1420.405 MHz. Because our galaxy is so rich in terms of neutral hydrogen, a radio telescope like PICTOR is capable of detecting such faint radio emissions. When the telescope is pointing to the galactic plane (the Milky Way band), the intensity around 1420 MHz gets significantly stronger. Radio astronomers are able to use information like the Doppler shift such emissions have undergone, in order to determine neutral hydrogen concentration, map the spiral geometry of our galaxy, and even provide evidence for the existence of dark matter by plotting the rotation curve of the Milky Way!</p>\n\n<p>In order to observe with PICTOR, a user can just visit www.pictortelescope.com, click \"Observe\", fill in their observation parameters (frequency, observing duration etc.) and submit their observation, and as soon as the observation is finished, the user will receive an email with their observation data and the parameters they entered.</p>\n\n<p>Since the initial launch, PICTOR has gotten lots of updates and improvements, particularly in the software backend, providing more data to the users, using advanced techniques to increase the signal-to-noise ratio by calibrating spectra and mitigating radio frequency interference (RFI) (if present), and more.</p>\n\n<p>There is also a PDF for users who are unfamiliar with radio astronomy and radio telescopes to get started: https://www.pictortelescope.com/Observing<em>the</em>radio<em>sky</em>with_PICTOR.pdf</p>\n\n<p>PICTOR is a fully open source (software &amp; hardware) project, and everything can be found on the GitHub repository: https://www.github.com/0xCoto/PICTOR</p>",
  "persons": [
    "Apostolos Spanakis-Misirlis"
  ]
}