{
  "start": 1577894400000,
  "duration": 50,
  "room": "K.1.105 (La Fontaine)",
  "title": "Making & Breaking Matrix's E2E encryption",
  "subtitle": "In which we exercise the threat model for Matrix's E2E encrypted decentralised communication",
  "track": "Miscellaneous",
  "abstract": "Matrix is an open protocol and open network for decentralised real-time communication; shifting control over communication from the big proprietary silos back to the general population of the Internet. In 2016 we added E2E Encryption based on the Double Ratchet, and since then have been working away on getting the encryption so polished that we can transparently turn it on by default everywhere.  In this talk, we'll show how we have finally done this, what the blockers were, and then try to smash the encryption to pieces to illustrate the potential attacks and how we mitigate them.",
  "description": "Matrix is an ambitious project to build a open decentralised real-time communication network; providing an open standard protocol and open source reference implementations, letting anyone and everyone spin up a Matrix server and retake control of their real-time communication. Matrix is looked after by the non-profit Matrix.org Foundation, and as of Oct 2019 we have over 11.5M addressable users and around 40K servers on the public network.\n\nOver the course of 2019 we spent a huge amount of time finalising Matrix's end-to-end encryption so we could finally turn it on by default without compromising any of the behaviour users had grown accustomed to in non-encrypted rooms.  Specifically, the main remaining blockers were:\n * Ability to search in E2E encrypted rooms (now solved by Seshat: a Rust-based full-text-search engine embedded into Matrix clients)\n * Ability to get compatibility with non-E2E clients, bots and bridges (now solved by pantalaimon: a daemon which offloads E2E encryption)\n * Reworking the whole encryption UI to expose cross-signing to radically simplify key verification (including QR-code scanning for simplicity)\n * Ability to receive notifications in E2E encrypted rooms.\n\nHowever, we have finally got there, and this talk will demonstrate how the final E2EE implementation works; the final problems we had to solve; the threat model we have implemented; and how we're doing on rolling it out across the whole network.  More interestingly, we will then demonstrate a variety of attacks against the encryption (e.g. shoulder-surfing QR codes during device verification; MITMing TLS; acting as a malicious server implementation; global passive adversary) to demonstrate how well we handle them.",
  "persons": [
    "Matthew Hodgson"
  ]
}