{
  "start": 1577881200000,
  "duration": 15,
  "room": "H.2215 (Ferrer)",
  "title": "Prototyping the Internet of Things with Wyliodrin STUDIO",
  "subtitle": "An open source platform for building IoT prototypes",
  "track": "Lightning Talks",
  "abstract": "<p>In 2014, teaching a Raspberry Pi programming course was a real challenge, mostly due to the lack of development devices. This is how we came up with the idea of building Wyliodrin STUDIO.</p>\n\n<p>Wyliodrin STUDIO is an easy to use IDE for the Internet of Things that enables remote control over embedded devices. While it is a good prototyping tool, the platform also targets students and educators who want to get started in the IoT field. It is designed to help both technical and non-technical people to get started with programming devices such as the Raspberry Pi.</p>\n\n<p>In this talk we aim to present Wyliodrin STUDIO, how it works and how we and other universities used it to teach IoT technologies in classes such as computer science, power engineering and film directing.</p>",
  "description": "<p>Wyliodrin STUDIO is an open source, web-based IDE designed for fast prototyping of Internet of Things applications.</p>\n\n<p>We have build this platform because we needed an affordable way of programming embedded devices such as the Raspberry Pi. Since 2014, when the first platform version was released, we have improved the solution so now it can be used to remotely program, control and monitor devices. For the moment, the platform is compatible with devices such as the Raspberry Pi and BeagleBone Black and supports Python, Node.js and visual, block-based programming languages.</p>\n\n<p>Since 2014 the platform has been used by companies such as Intel and Cisco and in institutions such as UCLA, USC, Ulm University and Toronto Public Library.</p>\n\n<p>The purpose of our presentation is not only to make an overview of Wyliodrin STUDIO's characteristics, but also introduce the audience to our experience in teaching IoT courses and how the platform helped us.</p>",
  "persons": [
    "Alexandru Radovici"
  ]
}