{
  "start": 1577872800000,
  "duration": 50,
  "room": "Janson",
  "title": "Is the Open door closing?",
  "subtitle": "Past 15 years review and a glimpse into the future.",
  "track": "Freedom",
  "abstract": "\"Open Source\" has been wildly successful, no doubt.\n\nYet, in recent years, we have seen a massive amount of failed 'open' projects.\n\nWhy is that?\n\nI have identified 10+ scenarios in which the 'Open' approach works. But what is most interesting, is that those scenarios have enabling conditions, and while those conditions are taken for granted, they are not.\n\nNot every 'Open' project is sustainable. Not every project is worth adopting or contributing to.\n\nDuring the presentation, we will look into what works and why, and what to expect from different 'Open' initiatives. We will cover almost everything that can be open - starting from hardware, through software, education, and we will end up covering Open Governments.\n\nEach sector is different, and for some of them, the 'Open' approach will not work. Come and see what I have found out in this space during my research, and evaluate whether you are working on the right project.\n\nBecause the only resource you will never get back is time.",
  "description": "If you are using or contributing to a software projects, especially on your own, you certainly want to know whether your project has a chance of slipping into oblivion.\nDescribed scenarios will not only help you to answer that question, but will also help you to figure out what is most important for your project, right now.\n\n<h1>The scenarios that will be covered include:</h1>\n\n<ul>\n<li>Open Hardware - DIY movements, when 'Open' is used quite cunningly to explore possibilities.</li>\n<li>Open Hardware - farming and ecology - a noble idea which is deeply flawed because it does not take into account basic economic rules.</li>\n<li>Open Content - beneficial to many people and organisation, but not necessarily for content creators.</li>\n<li>Open Education - yet another great idea, which has a hidden catch that makes or breaks it, depending on how the idea is executed.</li>\n<li>Open Access &amp;  Science - a rebellion against corporations that slow down the growth of humanity.</li>\n<li>Open Collaboration - projects run in this spirit let us advance knowledge and technical capabilities, but they do not promise financial returns.</li>\n<li>Bypass high cost of adoption - the idea that you can use software without going through a 3 months approval process was appealing in 1990. But today... that business model is going away thanks to the security folks.</li>\n<li>Open as a marketing tool - if it has 'Open' in the name, it is not open.</li>\n<li>Open Pet Projects - that deserves only mention, because there are so many such projects, but almost none of them is sustainable.</li>\n<li>Open Legislations and Governments - a futile attempt to increase transparency</li>\n<li>Open Data - very difficult to monetise, increasingly dangerous to consume</li>\n<li>Open Standards - a lot of legal uncertainties</li>\n</ul>",
  "persons": [
    "Krzysztof Daniel"
  ]
}