{
  "start": 1577878800000,
  "duration": 15,
  "room": "H.2215 (Ferrer)",
  "title": "Open Source for students, by students",
  "subtitle": "Teaching university students how to contribute to open source projects by providing a product to their peers",
  "track": "Lightning Talks",
  "abstract": "<p>Five years ago, Semester.ly was created for students, by students. As a one stop shop for students to find classes that fit their schedule, Semester.ly has course reviews, textbook prices, and the classes your Facebook friends are taking. As a student start-up, it quickly expanded to 8+ schools and accumulated 100,000 users. In 2016, Semester.ly went open source and many of its core members graduated. Over the past three years, university administrators and students have worked together to maintain Semester.ly’s success and grow it as an educational tool within universities. Semester.ly’s serves two purposes now: make course registration easier and teach students how to contribute to open source projects.</p>",
  "description": "<p>Every semester, students at universities across the country scramble to plan their course schedules for the upcoming academic term. Post-it notes, Excel spreadsheets, emails, and group chats all make up a stressful period in an already stressed out student’s life. The problem is simple: university backed course scheduling infrastructure is outdated. Universities have been around for hundreds of years and their internal software for decades, yet their students are a part of a technology revolution that expects things to be fast and social&lt;sup>1&lt;/sup>.</p>\n\n<p>A few months after tangling with course registration woes, students are engrossed in another stressful time period in which they attempt to acquire jobs. Employers look for experienced qualified candidates. Students go to school to become these candidates but most of the time, they just get a piece of paper that is losing value in the public mind&lt;sup>2&lt;/sup>. Universities try their best to prepare their students for the workforce through rigorous classwork and career resources but today’s workforce is ultra competitive and a college education isn’t enough&lt;sup>3&lt;/sup>.</p>\n\n<p>Here lie two seemingly unrelated problems for universities. University course registration systems are falling behind and universities aren’t fitting student’s needs in preparing them for post-graduation employment. Semester.ly solves both problems.</p>\n\n<p>Semester.ly was founded by an initial development team of Noah Presler, Felix Zhu, and Rohan Das during the summer of 2014. Back then, the goal of Semester.ly was to improve course registration. Before the founding team graduated, Semester.ly went open source in Spring 2016 with the hope that other students would carry on the torch. However, it was hard to find dedicated developers and funding without a business plan that involved making money later. These are problems that many open source organizations face but being based at a university also meant that team members would inevitably graduate every few years. There was a need for consistent members, incentives for developers, and funding for the server.</p>\n\n<p>Three organizational structures were created to solve these problems. The first was a student organization. This seemed like the obvious first choice since it's how the original team started but student developers didn’t have any incentive and would stop working once school work picked up. The second structure was a course to obtain credit for working on open source projects. After conversations with the Chair of the Computer Science Department at Johns Hopkins University, a course called Software for Resilient Communities was created focusing on four open source projects to benefit local and global communities&lt;sup>4&lt;/sup>. Since this was a course, students would take the first half of the semester to learn the technology stack, make an impact, and then never contribute again because they couldn’t repeat the class. This did succeed in getting lots of students exposed to open source projects but eventually the professor running the course left to run his own company and the course wasn’t offered again. The third and final organizational structure that Semester.ly maintains today is as a paid on-campus job. After all of these years, Semester.ly has become a strong presence on campus and school administrators have taken notice. To support our mission, Johns Hopkins Information Technology provides hosting, hourly pay for student developers, and consistent leadership for students. This organizational structure has been in place for about a year now and we’ve made great progress onboarding new student developers and creating new features.</p>\n\n<p>With this partnership, Semester.ly is more integrated with the university and several other partnerships have arisen. For example, Semester.ly now shows what tutoring services are available through the university and we’re developing a way to register for these tutoring services on Semester.ly next semester. Going forward, Semester.ly will continue to make course registration easier as well as provide whatever other services students see fit. Semester.ly proves that it's possible for open source projects to thrive on college campuses as a service and educational tool.</p>",
  "persons": [
    "Kristin Yim"
  ]
}