{
  "start": 1577877300000,
  "duration": 20,
  "room": "AW1.126",
  "title": "Arabesque: a geographic flow visualization application",
  "subtitle": "",
  "track": "Geospatial",
  "abstract": "Arabesque is a FLOSS web application dedicated to flow mapping and analysis. Using web technologies, it provides tools to the user to load O/D data. The user can easily modify filters parameters or add new ones. A default symbology is proposed but the user can define is own.\n\nArabesque aims to provides a fast, lightweight framework to visualize and explore flow data with a special attention on graphics and symbology in order to produce beautiful and just flow maps.\n\nThis presentation will be a short presentation of the project and a quick demo of the application. It is the extension of the presentation made at FOSS4G 2019: release, code publication, updates and a live demo.",
  "description": "Geographic flow visualization (gFlowiz) is an interdisciplinary project dedicated to flows and networks in the geoweb.\nIt is led by a team of French researchers and engineers in Geography, Cartography and Computer Science from both IFSTTAR and CNRS.\n\nA state of the art on current issues of flows and movement analysis on the geoweb has been produced through the compilation of around 70 applications in a thematic dashboard, and a 200 respondants survey on flow map usages and needs has been realized.\n\nThe results of this were combined to create the specifications of the Arabesque application.\nArabesque is a FLOSS web application dedicated to flow mapping and analysis. Using web technologies, it provides tools to the user to load Origin/Destination data in robust and well documented formats (CSV or geojson). Arabesque will display the most significant data at launch but the user can easily modify filters parameters or add new ones on nodes and/or links. A default symbology is proposed but color scales, size, transparency and shape of objects can be modified as well.\n\nArabesque aims to provides a fast, lightweight framework to visualize and explore flow data.\nA special attention has been provided on graphics and use of correct symbology in order to produce\nbeautiful and just flow maps.\n\nThis presentation will be a short presentation of the Gflowiz project and a quick demo of the Arabesque application.\n\nSpeaker bio\n\n\nNicolas Roelandt works at the IFSTTAR research institute as a GIS engineer. He is an OSGeo charter member and an OSGeoLive PSC member.\nFrançoise Bahoken is researcher in geography at the IFSTTAR research institute. Her subject is flow and movements geographical patterns through cartography\nLaurent Jégou is a cartographer and geographer at the Toulouse-Jean Jaurès University\nMarion Maisonobe is a geographer at the CNRS research institute. She studies scientific networks and their geography.\nEtienne Côme is researcher at the IFSTTAR research institute.  His research interests include probabilistic graphical models, data-science and visualisation and their use to solve transportation problems.\nGrégoire Le Campion works at the [CNRS research institute] (http://http://www.passages.cnrs.fr/) as a data science/statistical engineer.\n",
  "persons": [
    "Nicolas Roelandt"
  ]
}