{
  "start": 1577871600000,
  "duration": 20,
  "room": "AW1.126",
  "title": "Introduction to openEO",
  "subtitle": "openEO develops an open API to connect R, Python, JavaScript and other clients to big Earth observation cloud back-ends in a simple and unified way",
  "track": "Geospatial",
  "abstract": "<p>openEO is a new API specification for Earth Observation data cubes that supports data extraction, processing and viewing.</p>\n\n<p>Both the standard and its implementations are Open Source projects, which itself rely on Open Source libraries under the hood, such as GRASS GIS, GDAL, Geotrellis, Rasdaman, or provide a standardized interface to proprietary systems such as Google Earth Engine. Client implementations are available for JavaScript, R, Python, QGIS and web browsers.</p>\n\n<p>This talk will show an overview of the main capabilities, and available client and backend implementations.</p>",
  "description": "<p>Earth Observation data are becoming too large to be downloaded locally for analysis. Also, the way they are organised (as tiles, or granules: files containing the imagery for a small part of the Earth and a single observation date) makes it unnecessary complicated to analyse them. The solution to this is to store these data in the cloud, on compute back-ends, process them there, and browse the results or download resulting figures or numbers. Unfortunately, data and APIs are too often proprietary solutions and lock-in to a service provider happens easily so an interoperable standard across service providers is much needed.</p>\n\n<p>The aim of openEO is to develop an open API to connect R, Python, JavaScript and other clients to big Earth observation cloud back-ends in a simple and unified way. With such an API, each client can work with every service provider, and it becomes possible to compare them in terms of capacity, cost, and results (validation, reproducibility).</p>\n\n<p>The specification is centered around Earth Observation data cubes that supports data extraction, processing and viewing. It specifies a set of common processes to be used so that switching between service providers is less of a problem. Both the standard and its implementations are Open Source projects. Under the hood, the client and backend implementations rely on Open Source libraries, such as GRASS GIS, GDAL, Geotrellis, Rasdaman, but also provide a standardized interface to proprietary systems such as Google Earth Engine.</p>",
  "persons": [
    "Matthias Mohr"
  ]
}