{
  "start": 1577883600000,
  "duration": 55,
  "room": "K.3.201",
  "title": "Using systemd security features to build a more secure distro",
  "subtitle": "",
  "track": "Distributions",
  "abstract": "<p>Systemd provides a bunch of features which can be used to contain and secure services,\nmaking security and isolation primitives provided by the kernel accessible to system programs.\nThis allows service authors to write much simpler code, and often to avoid any integration\nwith the operating system for security purposes.\nUnfortunately, those features are still not widely used, possibly because developers\nwant to maintain compatibility with a wide range of systems.</p>\n\n<p>I'll talk about the features that are the most useful,\nhow they can be used in practice, and how this could be used\nto make a noticeable change in security at the distribution level.</p>",
  "description": "<p>The number of security features that systemd provides is long and growing:\nFirst, it performs setup like creating runtime directories and opening sockets, so the service doesn't need privileges.\nSecond, it makes it easy to run services as unprivileged users, removing a whole set of problems.\nThird, it uses kernel features like mount and network namespaces, capabilities, resource limits, to constrain services.\nFourth, it implements additional filters using BPF (per-service firewalls, devices controller).\nFifth, it does resource cleanup after the service is done, removing the need for privileges again.</p>\n\n<p>We could use this to vastly simplify services and to provide an additional level of security for system services.\nSome distributions are making use of this, but not nearly enough.\nFedora is probably at the forefront, but the common case is still to run as root will full access to everything the service doesn't need.\nDebian is now discussing a General Resolution to drop SysV Init compatibility and empower packagers to use all systemd features.\nFull support in the two biggest distro families would motivate upstreams to make systemd their \"baseline\" and build more secure services.\nNew features like \"dynamic users\" could be used to make Linux systems take more modern approaches to system security.</p>\n\n<p>I want the talk to serve as a prompt for a general discussion how we could modernize service packaging in distros,\nto avoid reimplementing security features in individual daemons, and how to stop the 90's mentality of running everything as root.</p>",
  "persons": [
    "Zbigniew Jędrzejewski-Szmek"
  ]
}