{
  "start": 1577894400000,
  "duration": 30,
  "room": "AW1.120",
  "title": "openwifi",
  "subtitle": "Opensource \"Wi-Fi chip design\" and Linux driver",
  "track": "Free Software Radio",
  "abstract": "An open source \"Wi-Fi chip design\"(Will be AGPLv3) will be presented and a live demo will be shown in the room! The design is based on SDR (Software Defined Radio) and offers full-stack 802.11a/g/n capabilities on FPGA and ARM Linux (Xilinx Zynq SoC + AD9361 RF front-end).It conforms with Linux mac80211 framework and behaves just like COTS Wi-Fi chip under Linux. The main components of the design are: RF front-end control; PHY; low-MAC; interfacing (DMA, register) with ARM; mac80211 compliant Linux driver; high-MAC (mac80211 framework); Linux user space tools (ifconfig, iwconfig, dedicated tools via netlink).​ Since it is a SDR based \"white box\" design instead of commercial “black box” chip, you can do Wi-Fi research and customization without any reverse engineering efforts.\n\nWhy does it fit FOSDEM?\n\nIt will be the 1st open source project for full-stack Wi-Fi SDR implementation. Lots of people, especially wireless network/security researchers, SDR researchers and hackers, will be interested in. We are eager to show the demo in the room and hear feedback from people/community. Potential contributors are also very welcomed, and we will be glad to offer help.",
  "description": "Overall architecture: Please find attachment.\n\nFeatures:\n\n<ul>\n<li>802.11a/g; 802.11n MCS 0~7; 20MHz</li>\n<li>Mode: Ad-hoc; Station; AP</li>\n<li>DCF (CSMA/CA) low MAC layer in FPGA</li>\n<li>Configurable channel access priority parameters:</li>\n<li>duration of RTS/CTS, CTS-to-self</li>\n<li>SIFS/DIFS/xIFS/slot-time/CW/etc</li>\n<li>Time slicing based on MAC address</li>\n<li>Easy to change bandwidth and frequency:</li>\n<li>2MHz for 802.11ah in sub-GHz</li>\n<li>10MHz for 802.11p/vehicle in 5.9GHz</li>\n<li>On roadmap: 802.11ax</li>\n</ul>\n\n\nSupported SDR platforms:\n\n<ul>\n<li>zc706 (Xilinx) + fmcomms2 (Analog Devices)</li>\n<li>On roadmap: ADRV9361-Z7035/ADRV9364-Z7020 + ADRV1CRR-BOB (Analog Devices)</li>\n<li>On roadmap: zcu102 (Xilinx) + fmcomms2/ADRV9371 (Analog Devices)</li>\n</ul>",
  "persons": [
    "Xianjun Jiao"
  ]
}