{
  "start": 1577887200000,
  "duration": 20,
  "room": "H.2213",
  "title": "Beyond the Pile of Knobs: Usability and Design for Privacy, Security, Safety & Consent",
  "subtitle": "Privacy and security shouldn't be a privilege or inaccessibly complex. We will share what we've learned working with projects that center security and privacy to support vulnerable populations.",
  "track": "Open Source Design",
  "abstract": "Simply Secure will share examples of how we can design, centering the needs of the most vulnerable. We will present the problems, e.g. why the UX patterns that make consenting or refusing consent so difficult in practice and why open source security tools are often associated with bulky user interfaces and inaccessible jargon, and share findings from our 5 years of working with projects in the Internet Freedom, Digital Rights, Media Justice, Translation, Training, Civic Tech and Development communities.",
  "description": "Security and privacy are usually handed off to development teams as technical challenges, with the design and user experience as an after thought — meaning that as designers, we are building off of limited examples and a small research field. With security risks posing a real threat on the internet, design and usability are critical to building safer more trustworthy technology because users will work around poorly design experiences.\n\nIn this talk, we will share examples of how we can design, centering the needs of the most vulnerable. We will present the problems, e.g. why the UX patterns that make consenting or refusing consent so difficult in practice and why open source security tools are often associated with bulky user interfaces and inaccessible jargon, and share findings from our 5 years of working with projects in the Internet Freedom, Digital Rights, Media Justice, Translation, Training, Civic Tech and Development communities.\n\nSimply Secure is a nonprofit that supports practitioners by putting people at the center of trustworthy technology. Launched in 2014, our work focuses on building technology that enhances and protects human dignity by centering the needs of vulnerable populations. We use a human-centered approach because we believe that the user experience of a device, program, or application plays a critical role in building trustworthy technology. At a minimum, responsible user experience (UX) offers timely, comprehensible, and actionable information to users — it gives them genuine agency in interacting with the system. Fundamentally our goal is to support practitioners in developing the skills needed to work on the wicked problems presented by technology today.",
  "persons": [
    "Georgia Bullen"
  ]
}