{
  "start": 1577896200000,
  "duration": 30,
  "room": "UA2.220 (Guillissen)",
  "title": "Who will Decentralise the Fediverse?",
  "subtitle": "Self hosting on the Fediverse 3 years on.",
  "track": "Decentralized Internet and Privacy",
  "abstract": "<p>The promise of the internet has not been kind. In mainstream tech and open source alike, social media tech has failed a lot of people. People often face surveillance and abuse over valuable human interaction, or technology for technology's sake.</p>\n\n<p>Software like Mastodon has signaled a significant step forward towards a vision for how we can take existing social media and distribute power so that people can benefit.\nIn many respects, the experience is still not ideal, this talk highlight some of the key point that can make or break the fediverse</p>",
  "description": "<p>The talk will be split in 3 parts.\nMostly looking at the past and the Fediverse history.\nThe present and the set of challenges\nThe future and some proposal on how to overcome those challenges.\nQuesions</p>\n\n<h1>Past:</h1>\n\n<p>The success of Mastodon and other AP compatible software brought a lot of people from different sphere together, and with that diversity the network took off.</p>\n\n<p>Free and Open Source enthusiasts, activists, hacktivists, sex workers, G+ / Tumblr/Twitter refugee, communities of interest (tabletop, craft, parenthood, etc.) and people that simply wanted a more personal place to socialise, all mingled together and really pushed the envelop of what a social network can be.</p>\n\n<p>Within this mix of people and interest, the most marginalized people challenged the status quo and got us better tools than we ever had like post visibility, content warning, image description, etc.  as a standard way of communication.</p>\n\n<h1>Forward to today:</h1>\n\n<p>There are a few major obstacle for the fediverse to operate:\n* A naive vision of moderation and hostile actors constantly puts community moderators on the back foot. Gab and kiwifarm showed us that admins need to be constantly on the lookout if they want to protect their community</p>\n\n<ul>\n<li><p>Activity Pub software, by and large, are not made for efficiency. It's hard to host a Mastodon instance unless you have can afford expensive hosting and storage fees.</p></li>\n<li><p>Designs within AP compatible software is often confusing and not very friendly for newcomers. We have seen how waves of people come to the fediverse and how most of them leave again, unable to comprehend the experience possible.</p></li>\n<li><p>Marginalised communities are less and less heard, diminishing the trust in the current tooling. The fediverse pushing for a mainstream audience means that marginalised communities are now mostly operating in forks and the fringe rather than able to contribute to upstream.</p></li>\n<li><p>Tools and software have an increasing emphasis on emulating proprietary software like Twitter/Youtube/etc. The current direction is replicating mechanism to drive engagement rather than fostering meaningful interactions between people.</p></li>\n<li><p>ActivityPub - the protocol that Mastodon really help get traction, has significant privacy and security flaws. This is one of the fundamental challenge we currenltly have. It is being worked on.</p></li>\n</ul>\n\n\n<h1>Future</h1>\n\n<ul>\n<li>Proposal on some of the key feature and changes that would solve some of the problems mentionned above.</li>\n</ul>\n\n\n<h1>Question</h1>\n\n<p>Question from the audience.</p>",
  "persons": [
    "kyzh"
  ]
}