{
  "start": 1577874900000,
  "duration": 30,
  "room": "K.4.201",
  "title": "GDB pipelines -- convenience iteration over inferior data structures",
  "subtitle": "Bringing MDB's \"walkers\" to GDB",
  "track": "Debugging Tools",
  "abstract": "We introduce a GDB plugin for working with large data structures in the inferior.\n\nThis plugin brings some of the flexibility of Unix pipelines to the GDB command prompt, providing the ability to <em>conveniently</em> run some action on every element in a data structure that matches certain criteria.\n\nOne big aim of this plugin is to make it easy and convenient for a user to write their own sub-commands to iterate over the data structures used in their own program.\n\nThis is intended for anyone who has found difficulty inspecting large data structures from inside GDB.",
  "description": "MDB -- the debugger on Solaris -- has a feature called \"walkers\" that is used to great effect when inspecting the contents of large data structures in the Solaris Kernel.\n\nWe introduce a GDB plugin to provide the same type of functionality.\n\nSimilar to Unix pipelines, one can now flexibly write a surprisingly powerful command by combining several \"walkers\".\n\nSome examples are:\n- Search an inferior data structure for nodes that are malformed.\n\n<pre><code> gdb-pipe &lt;mywalker&gt; &lt;startnode&gt; | if ! &lt;some verification test&gt;\n</code></pre>\n\n<ul>\n<li>Put breakpoints on member functions of those nodes in a data structure matching some criteria.\n   gdb-pipe &lt;mywalker> &lt;startnode> | if &lt;interesting-check> | show break {}->function-member</li>\n<li>Put breakpoints on a given function when passed a node that matches some criteria.\n   gdb-pipe &lt;mywalker> &lt;startnode> | if &lt;interesting-check> | show break somefunc if &lt;arg> == {}</li>\n</ul>\n\n\nThis plugin has a strong aim to make it easy for users to write \"walkers\" over their own data structures, and already has \"walkers\" for the open source projects \"neovim\" and \"GCC\".\n\nWe would like to discuss possible future directions for this plugin with regards to speed improvements to work on extremely large data structures, and how there could be a tie-in with pretty-printers.",
  "persons": [
    "Matthew Malcomson"
  ]
}