{
  "start": 1577892900000,
  "duration": 25,
  "room": "UB5.230",
  "title": "Engaging Enterprise consumers of OSS",
  "subtitle": "Enterprise contribution, participation, and support of OSS",
  "track": "Community devroom",
  "abstract": "<p>It is no secret that open source software is a foundational element to many enterprise IT and software development strategies and it's also not a secret that the rate of participation, contribution, or support amongst many enterprise companies lags significantly behind the adoption rate. Higher rates of participation are seen in software-based or forwarded companies founded in the past decade, but older companies have been slow to adapt. The solution to participation is often seen as a cultural shift, but this only accounts for a portion of the lack of participation. Motiviation and incentive structures, legal structures, and project governance and management structual alignments can have a bigger impact on enterprise participation in open source projects. In this talk I'd like to discuss a mixture of academic research and my personal real-world experience in bridging the gap between enterprise development and open source projects.</p>",
  "description": "<p>Over the past decade Open Source has grown to become the de facto standard and preferred software for Enterprise businesses and government agencies and continues to be the choice amongst small businesses and non-profits. We are now entering a new era where not only are these organizations adopting the use of Open Source, but they are actively participating in and contributing back to the projects. This is a large shift that requires change both within the Enterprise organizations and in the open source projects to welcome these new contributors and methods of working. However, not all organizations are ready for this shift and not all open source projects are ready to handle enterprise collaboration.</p>\n\n<p>As an example the motivation and incentive structure are often misaligned with an open source project incentivizing long-term participation and enterprise software development encouraging short and fast development and deployment. The problem is compounded when discussing the role of system integrators, outsourced development agencies, and consulting agencies, which are frequently used to accelerate the development of enterprise software. This mismatched timelines, management practices, and incentive structured can lead to reduced participation in open source software. However, there are changes that can be made on both sides to counteract this tension, which can lead to greater participation of enterprise software developers in open source software.</p>\n\n<p>In this talk I’d like to call upon academic research and lessons learned in other industries. In particular I pull lessons from the following areas:</p>\n\n<p>“Community Development as a Process: 1970 - Lee J. Cary - A collection of academic researching in community development organizations with reviews of the psychological (Warren C. Haggstrom) and sociological (Willis A. Sutton, Jr) implications of development organization (including discussions of Burnout and the impact thereof to the individual and community), and the role of the agent in the community development process (Robert Morris)</p>\n\n<p>“Governing The Commons” - 1990 - Elinor Ostrom - An academic review of institutions for collective actions including longitudinal studies of fisheries and forest management.</p>\n\n<p>“Roles of Boundary Organizations” - 2008 - Siobhan O’Mahony and Beth A. Bechky (University of California, Davis) - Research drawing on social movement and organizational theory that reviews the roles of a boundard organization (Association, Foundations, etc.) in managing four critical domains - governance, membership, ownership, and control over production - to provide\nanalytic levers for determining when boundary organizations work.</p>\n\n<p>“How Firms Leverage Crowds and Communities for Open Innovation” - 2016 - Joel West (Keck Graduate Institute) and Jonathan Sims (Babson College) - Research on crowds and communities, identifying a third form — a crowd-community hybrid — that combines attributes of both</p>\n\n<p>\"100 Years of Sustainability\" - 2019 - Me :) Jacob Redding - A review of the American Society of Composers, Artists, and Publishers (ASCAP) and the lessons the open source world could learn and adapt to build the next century of sustainability in open source development and innovation.</p>\n\n<p>In addition I want to bring in my own personal experience spending 12+ years growing the Drupal Open Source project spending time as a developer, founding board member, and founding Executive Director watching the project grow from a handful of developers to over 30,000 active contributors. I also pull from the other side of the table in my current role as an Open Source Strategy/Governance lead within Accenture - a systems integrator with nearly 500,000 employees worldwide. In my role at Accenture I craft our internal open source strategies including the use of Inner source and legal and cultural shifts to encourage more open source participation.</p>",
  "persons": [
    "Jacob Redding"
  ]
}