{
  "start": 1577890800000,
  "duration": 40,
  "room": "H.1308 (Rolin)",
  "title": "Akraino Edge KNI blueprint",
  "subtitle": "A Kubernetes Native Infrastructure approach to the Edge",
  "track": "Software Defined Networking",
  "abstract": "<p>Blueprints in the Kubernetes-Native Infrastructure Blueprint Family leverage the best-practices and tools from the Kubernetes community to declaratively manage edge computing stacks at scale and with a consistent, uniform user experience from the infrastructure up to the services and from developer environments to production environments on bare metal or on public cloud.</p>\n\n<p>All blueprints in this family share the following characteristics:</p>\n\n<ul>\n<li>K8s Machine API: declarative API to manage a configure the infrastructure of a cluster.</li>\n<li>Operator Framework: automated and secure lifecycle of applications running on the edge stack.</li>\n<li>Kubernetes-native workloads: allowing the mix of CNFs and VM-based workloads via Kubevirt.</li>\n</ul>\n\n\n<p>Come and see the leading edge!</p>",
  "description": "<p>Launched in 2018, Akraino Edge Stack aims to create an open source software stack that supports high-availability cloud services optimized for edge computing systems and applications.</p>\n\n<p>As part of the Akraino project, Kubernetes-Native-Infrastructure blueprint family represents the reference edge stack managed as a declarative platform, where controllers monitor a system for deviations between the user-declared target state and reality and take corrective\nactions to reconcile reality with the declared target state.</p>\n\n<p>KNI blueprints cover up two different use cases:</p>\n\n<ul>\n<li><p>Provider Access Edge: as part of the network transformation, telco operators are moving to run its radio access network in a cloud-native manner. Technologies like vRAN will be only possible with a declarative approach, and leveraging open networking best practices.</p></li>\n<li><p>Industrial Edge: workloads such IoT, AI/ML, AR/VR, and ultra-low latency control will be run in the edge. These workloads will require specific hardware such GPUs and FPGAs. KNI can show how this needs can be a reality today.</p></li>\n</ul>\n\n\n<p>With Kubernetes Native Infrastructure learn about the k8s way of managing infrastructure. By defining a declarative state, the edge administrator will be able to manage thousands of sites by following an innovative GitOps approach.</p>\n\n<p>If you are interested in these exciting topics, don't miss the talk!</p>",
  "persons": [
    "Yolanda Robla Mota",
    "Ricardo Noriega"
  ]
}