{
  "start": 1577879400000,
  "duration": 25,
  "room": "UD2.120 (Chavanne)",
  "title": "Monitoring strawberries",
  "subtitle": "Building observability for indoor farming",
  "track": "Monitoring and Observability",
  "abstract": "<p>According to the United Nations, 2.5 billion more people will be living in cities by 2050. This trend has caused indoor farming to draw a lot of attention and effort in recent years, in an attempt to scale the production of highly nutritious, healthy food inside cities.</p>\n\n<p>Over the past 3 years, Agricool has recycled 20 industrial containers into farms that grow strawberries, herbs and salads, in the very heart of cities, and without any pesticide. These urban farms are currently operated in Paris and Dubaï.</p>\n\n<p>Operating a fleet of indoor farms presents a diverse set of observability challenges. At the most traditional end of the observability spectrum, engineers rely on devops tools to operate computers, microservices, and an IoT infrastructure embedded inside the farms. On the other hand, living organisms like strawberry plants draw their own observability requirements, such as disease detection, physiological measurements, nutrient absorption, water analysis, or exposition rate to pollinating bumblebees.</p>\n\n<p>The purpose of this talk is to highlight observability challenges and best practices that are specific to indoor farming, and to illustrate them through the learnings that were made at Agricool when building observability pipelines.</p>",
  "description": "<ul>\n<li><p>Deployment of microservices to automate indoor farming environments.</p></li>\n<li><p>How to build an operational model for indoor farming based on telemetry, alerting and event stores, by using widely adopted devops/observability tools like Docker, Prometheus, InfluxDB, Grafana and Redash.</p></li>\n<li><p>Discover agronomic SLAs to drive design decisions for observability. eg. outages in irrigation systems that last too long can cause irreparable damage to strawberry plants, or a too great exposure to pollinating bumblebees can damage flowers and reduce yield.</p></li>\n<li><p>Understand that indoor farming requires to apply observability to a wide-ranging set of technical aspects such as microservices, hardware, sensors, actuators, hydraulic circuits, lighting systems, electrical cabinets, climate regulations, plant health or water quality.</p></li>\n<li><p>Build observability within an R&amp;D context in which scientists are continuously figuring out how to use time series to make breakthroughs about plant physiology.</p></li>\n<li><p>Align employees with different technical backgrounds (agronomists, engineers, technical operators) around a shared set of observability best practices.</p></li>\n<li><p>Enable domain experts to craft their own visualizations and alert rules.</p></li>\n</ul>",
  "persons": [
    "Jean-Marc Davril"
  ]
}