{
  "start": 1577889000000,
  "duration": 25,
  "room": "UB5.132",
  "title": "Selecting a Finite Element Analysis Backend for Exascale Fusion Reactor Simulations",
  "subtitle": "",
  "track": "HPC, Big Data, and Data Science",
  "abstract": "<p>Accelerating the development of fusion energy requires large scale simulations on cutting edge supercomputing resources.\nGreat hardware is only half the challenge and the software must be scalable to match.\nThis talk presents an objective approach to selecting a suitable back end to fusion simulations.</p>",
  "description": "<p>The UKAEA's mission is to develop commercially viable fusion energy.\nCurrent fusion technology is yet to break even\non power out compared to power in,\nthus designs for future reactors,\nwhich necessarily must exceed break even,\ncarry a great amount of uncertainty.\nWith cost estimates of a first of a kind fusion reactor\nin the order of billions of euros,\nany design flaw making it through to the construction stage\nwill be an expensive mistake.</p>\n\n<p>Thankfully, software can help.\nBy simulating a fusion reactor prior to construction,\nthe design can be tested and refined for a considerably lower cost.\nHowever, covering all the necessary scales and physics\nfor a digital twin of a fusion reactor\nrequires computational resources at the exascale.</p>\n\n<p>In this work, a number of potential finite element backends\nfor a multiphysics reactor simulation are evaluated.\nThe sheer scale makes open source a practical necessity\nand scalability is the primary performance metric.\nFrom the plethora of open source finite element libraries,\nthe most promising are selected\nand compared against a number of objective, unbiased criteria.</p>\n\n<p>None of the tested back ends scored perfectly in all criteria,\nso a method and rationale for weighting the results\nto select the best one for the purpose is presented.\nThe aspects of open source projects\nthat are important to high performance computing are highlighted.</p>",
  "persons": [
    "Aleksander J. Dubas"
  ]
}