{
  "start": 1577892600000,
  "duration": 30,
  "room": "UD2.218A",
  "title": "Using Micropython to develop an IoT sensor platform with an Augmented Reality UI",
  "subtitle": "How to marry the physical world and IoT with the virtual",
  "track": "Internet of Things",
  "abstract": "IoT with Augmented Reality\n\nAnyone with a curious mind and interested in how to marry the physical world and IoT with the virtual. This talk is pitched at intermediate, but for beginners extensive documentation and a github repo is available to read and learn from. It shows the tiny Micorpython Pyboard 'D' being used as a tiny web server serving up an Augmented Reality display. The display shows sensor data overlay on a marker used to identify the IoT device. The work is open sourced from a project being run at the Samsung Research Institute in the UK.",
  "description": "Using Micropython to develop an IoT multimode sensor platform with an Augmented Reality UI\n\nWho is this for\n\nAnyone with a curious mind and interested in how to marry the physical world and IoT with the virtual. This talk is pitched at intermediate, but for beginners extensive documentation and a github repo is available to read and learn from.\n\nWhat is it about\n\nThe story of a project at Samsung to capture data for the purpose of using in AI projects, which then became an OS platform with innovative ideas more important that the original concept. A multimode sensor platform using Augmented Reality for visualization.\n\nWill I See The Real Prototype\n\nYes there will be a demonstration of the prototype and this will be used as part of the talk to explain the concepts.\n\nWhat Technologies Will It Cover\n\nThis talk will cover a microcontroller with plug-able sensors using micropython for the main software development platform. For the serve side components the talk will be using a micro web server used to serve sensor data and a simple AR display. For Augmented Reality the talk will switch to using HTML and JavaScript needed to render objects in the browser for the demo.\n\nWhat Will I Learn\n\nHopefully you will learn an introduction to IoT concepts to developers who are interested in this tech, but we will use micropython for embedded systems and show how to used. You will see in this talk:\n1. How to use a tiny microcontroller with real sensors using micropython.\n2. How to connect 'things' to the platform.\n3. A micro web server to serve content.\n4. The web side, using web technologies like A-Frame, AR.js for the purpose of having AR capabilities.\n\nIn Summary\n\nThis talk will cover going from the small embedded world of IoT and sensors using micropython. Some time will be given to go over the general micro server. Then the last part of the talk will go over the concepts of Augmented Reality and using a mobile browser to view data from the sensors.\n\nResources\n\nThe main github repo for the project is here. It's open source and still changing. Be sure to keep track on it! :-)",
  "persons": [
    "Nicholas Herriot"
  ]
}