{
  "start": 1577893800000,
  "duration": 15,
  "room": "UD2.208 (Decroly)",
  "title": "Chat Over IMAP (COI): State of the Union",
  "subtitle": "When will messaging via e-mail crash the monopolies?",
  "track": "Real Time Communications",
  "abstract": "With the free &amp; open COI standard we enable every mail user to chat via email. We presented this idea last year, have in the meantime launched the COI plugin of the Dovecot IMAP server and the OX COI Messenger app. In this talk you will learn how the basic idea evolved over time, what we have learned during the journey, where we are heading to and: Why and how you should join us on that trip.",
  "description": "We presented the idea on last year's FOSDEM: Instead of trusting companies like Facebook, Tencent and rely on their infrastructure for personal communication, we wanted to create a new chat ecosystem based on open standards and federated infrastructure. As much as we like privacy-entered messengers like Signal, it's just another silo and you have to trust the provider.\nIn the end all popular messaging services today are proprietary, closed and operated by single providers.\nThis has unwilling consequences we are not willing to accept anymore:\nYour provider knows all about your social network: when you communicate with whom, the frequency of your communication and the number, type and length of your messages – even with end to end encryption in place.\nYou are locked in as a user: You cannot simply change to another provider, because your friends and peers are also using your current provider. If you want to switch you would need to convince everyone to follow. And of course you would lose all your conversation history if you dare to move away.\nThe network is only controlled by a single party, you cannot start hosting your own WhatsApp, WeChat or FB Messenger service. They set the rules and usually do not give you access to the API for creating your own software.\nSo why not taking an existing network based on open protocols which is already used by almost everyone? Why not using.... email? It already provides a federated infrastructure and is based on open standards like SMTP and IMAP. Why not building build a chat ecosystem on top of it? We called it COI - Chat Over Imap.\nThis was the initial idea and some key players joined the initiative around this idea right from the beginning: Dovecot (the most popular IMAP server), DeltaChat (an open source email based messenger) and Open-Xchange (an open source email technology and service provider) joined forces and kicked of COI - Chat Over IMAP.\nThe Dovecot team started working on extending the existing IMAP protocol and build some services on top to allow encrypted push notifications, to reduce latency etc. The DeltaChat developers worked on improving the client's core and adjust it to the needs of the Open-Xchange team who worked on compatible Flutter-based clients for Android and iOS. Of course everything was a little more complicated than most of us thought, but in the end we made it: In October 2019 we presented beta versions of iOS and Android COI Messenger clients and we introduced the COI plugin for Dovecot.\nIn this talk we will share the main challenges we have been facing while adding real-time messaging features to IMAP and how we solved them. And we will give insights into the problems we ran into in client development where we had to combine a Rust-based DeltaChat-Core code base with Flutter based mobile UIs and platform-specific native features.<br/>\nWe would also like to share with you what the main outstanding challenges are that might still stop us from being the WhatsApp killer we'd love to be.\nAnd of course we would love to encourage you to join the party.",
  "persons": [
    "Robert Virkus"
  ]
}