{
  "start": 1577879400000,
  "duration": 20,
  "room": "UD2.218A",
  "title": "Building IoT solutions with Eclipse IoT technology",
  "subtitle": "Building IoT solutions with Eclipse IoT technology",
  "track": "Internet of Things",
  "abstract": "The  IoT working group within the Eclipse Foundation is a joint effort to develop generic building blocks for creating IoT solutions. As of now, they host over 30 projects, which address different aspects of the realization of IoT use cases. The vast number of projects allow the design of tailored IoT solutions but bear the risk that people get lost in the wide range of projects. The recently introduced project Eclipse IoT packages will help here. It aims to provide pre-bundled software packages for the IoT.\n\nIn this talk, we are going to introduce the work of the Eclipse IoT working group and showcase selected projects with the focus on how one can use those technologies to build custom domain specific IoT solutions. Specifically, we will focus on the message hub Eclipse Hono,, the digital twin solution Eclipse Ditto, the update manager Eclipse hawkBit and Eclipse Vorto a description language for IoT devices. We further plan to show how one can combine and use the projects in a sensible way within the Eclipse IoT packages project.",
  "description": "Building your own backend for an IoT based solution can be difficult, as one needs to solve a number of challenges like among others connecting large number of devices in a scalable way, abstracting the access to the device and managing the software on the device. Within the Eclipse Foundation, developers contributes to over 30 projects to tackle the aforementioned and further issues. Various partners drive this working group from academia and industry like the strategic partners RedHat, Eurotech and Bosch. In this talk we intend to give an overview of the ongoing work in the working group and want to showcase some of the projects that are developed in that context. Namely, we plan to focus on the following projects:\n\nEclipse Hono – A scalable message hub for connecting a larger number of IoT devices to the cloud supporting various protocols\n\nEclipse Ditto – Abstracting the access to the state and actions of the physical IoT device in the digital world. This is done, by the provision of HTTP and WebSocket endpoints that can be used by other applications in order to access the data of the device or send commands to the device.\n\nEclipse hawkBit – Manage the software version of an IoT device and manage campaigns for rolling out new software updates.\n\nEclipse Vorto – Description language for stating the capabilities and features of an IoT device. The Eclipse Vorto models can then be used by other tools e.g. to provide an API for the features or generate implementations that are already integrated with the backend.\n\nBased on those projects it is possible to build your own IoT solution for which we will give examples during this talk. Moreover, we will introduce the new Eclipse IoT packages project, which aims to provide pre-bundled packages of Eclipse IoT projects. The aim of creating those packages is to support developers who want to leverage Eclipse IoT technology in their specific context or domain.",
  "persons": [
    "Sven Erik Jeroschewski"
  ]
}