{
  "start": 1577877300000,
  "duration": 20,
  "room": "UD2.208 (Decroly)",
  "title": "Crossing the Bifröst - Bridging All The Things with Matrix",
  "subtitle": "In which we bridge together as many comms systems as possible via Matrix",
  "track": "Real Time Communications",
  "abstract": "<p>Matrix is an open source project developing an open protocol and network for decentralised end-to-end-encrypted communication, providing a viable open alternative to the proprietary communication silos of WhatsApp, Slack, Discord and friends.  One of Matrix's main goals is to provide a highest-common-denominator open network which can bridge together existing communication silos.  In this talk, we'll show off Bifröst, our new application framework for building bridges, and demonstrate high quality bridging with XMPP, Slack, Discord, WhatsApp, and more!</p>",
  "description": "<p>Matrix owes its name to the idea of binding together existing communication platforms into an open 'matrix' in which they can interoperate.  Over the last year the wider Matrix ecosystem has been focusing increasingly on bridging, with lots of exciting development happening around:</p>\n\n<ul>\n<li>Bifröst - a TypeScript application framework for building bridges, including high quality XMPP support via xmpp.js and freeform protocol support via libpurple</li>\n<li>Slack - matrix-appservice-bridge, including bridging edits, reactions, threads, and full DM support via \"puppetting\"</li>\n<li>WhatsApp - mautrix-whatsapp, a fully functional WhatsApp bridge (using the API from WhatsApp Web)</li>\n<li>Discord - matrix-appservice-discord, with experimental puppetting support for full</li>\n<li>IRC - matrix-appservice-irc</li>\n</ul>\n\n\n<p>We'll explain all the flavours of bridging available these days (from bot-based, virtual users, puppetted, gatewaying etc) and show off Bifröst providing full gatewayed bridging between Matrix &amp; XMPP (so that anyone in Matrix can reach anywhere in XMPP and vice versa), as well as double-bridging (e.g. IRC&lt;->Slack via Matrix) - and generally illustrate how Matrix can be used to heal fragmented communities which have ended up shattered between Slack, Discord, IRC and other platforms.</p>",
  "persons": [
    "Matthew Hodgson"
  ]
}